# Список 1: Червона лінія (М1)
chervona_linia = ["Академмістечко", "Житомирська", "Святошин", "Нивки", "Берестейська", "Шулявська", 
                  "Політехнічний інститут", "Вокзальна", "Університет", "Театральна", "Хрещатик", 
                  "Арсенальна", "Дніпро", "Гідропарк", "Лівобережна", "Дарниця", "Чернігівська", "Лісова"]

# Список 2: Синя лінія (М2)
synia_linia = ["Героїв Дніпра", "Мінська", "Оболонь", "Петрівка", "Тараса Шевченка", "Контрактова площа", 
               "Поштова площа", "Майдан Незалежності", "Площа Льва Толстого", "Олімпійська", "Палац Україна", 
               "Либідська", "Деміївська", "Голосіївська", "Васильківська", "Виставковий центр", "Іподром", 
               "Теремки"]

# Список 3: Зелена лінія (М3)
syretsko_pecherska_linia = ["Сирець", "Дорогожичі", "Лук'янівська", "Золоті ворота", "Палац Спорту", "Кловська", 
                            "Печерська", "Звіринецька", "Славутич", "Осокорки", "Позняки", "Харківська", 
                            "Вирлиця", "Бориспільська", "Червоний Хутір"]


def sp_maker(sp):
    spisok = []
    for m in range(len(sp)-1):
        spisok.append((sp[m], sp[m+1]))
    return spisok
        
print(sp_maker(chervona_linia))