import networkx as nx
import matplotlib.pyplot as plt

# Списки станцій
chervona_linia = ["Акад", "Житом", "Свят", "Нивки","Берес", "Шуляв", "Політ", "Вокза", "Уніве", "Театр", "Хрещ", "Арсен", "Дніпр", "Гідро", "Лівоб", "Дарниц", "Черніг", "Лісова"]
synia_linia = ["Герої", "Мінсь", "Оболо", "Петрі", "Тарас", "Контр", "Пошто", "Майдан", "Площа Л", "Олімп", "Палац У", "Либід", "Демії", "Голос", "Васил", "Виста", "Іподр", "Терем"]
zelena_linia = ["Сирец", "Дорог", "Лук'я", "Золот", "Палац С", "Кловсь", "Печер", "Звіри", "Видуб", "Славу", "Осоко", "Позняк", "Харкі", "Вирлиц", "Борис", "Черво"]

# Створюємо граф
G = nx.Graph()

# Додаємо вершини з кольорами
for station, color in zip(chervona_linia + synia_linia + zelena_linia, ['red'] * len(chervona_linia) + ['skyblue'] * len(synia_linia) + ['green'] * len(zelena_linia)):
    G.add_node(station, color=color)

# Додаємо ребра між суміжніми станціями
all_lines = [chervona_linia, synia_linia, zelena_linia]
for line in all_lines:
    G.add_edges_from(zip(line, line[1:]))
    
# Додаємо ребра між станціями перетину гілок
G.add_edge("Золот", "Театр")
G.add_edge("Майдан", "Хрещ")
G.add_edge("Площа Л", "Палац С")

# Визначаємо позиції для кращого відображення(нажаль в ручному режимі)

pos = {"Акад": (-9, 3), "Житом": (-8, 2), "Свят": (-7, 1), "Нивки": (-6, 0), 'Берес': (-5, -1), 
       'Шуляв': (-4, -1), 'Політ': (-3, -1), 'Вокза': (-2, -2), 'Уніве': (-1, -2), 'Театр': (0, -2), 
       'Хрещ': (1.5, -2.5), 'Арсен': (3, -3), 'Дніпр': (4, -4), 'Гідро': (5, -5),'Лівоб': (6, -5), 
       'Дарниц': (7, -4), 'Черніг': (8, -3), 'Лісова': (9, -2),
              
       'Герої': (1, 6), 'Мінсь': (1, 5), 'Оболо': (1, 4), 'Петрі': (1, 3), 'Тарас': (1, 2),
       'Контр': (1, 1), 'Пошто': (1, 0), 'Майдан': (1, -1.5), 'Площа Л': (0, -3), 'Олімп': (-1, -4),
       'Палац У': (-1, -5), 'Либід': (-1, -6), 'Демії': (-2, -7), 'Голос': (-3, -8), 'Васил': (-4, -9),
       'Виста': (-4, -10), 'Іподр': (-4, -11), 'Терем': (-5, -12),
       
       'Сирец': (-3, 2), 'Дорог': (-2, 1), 'Лук\'я': (-1, 0), 'Золот': (0, -1), 'Палац С': (0.5, -4),
       'Кловсь': (1, -5), 'Печер': (1, -6), 'Звіри': (1, -7), "Видуб": (1.5, -8),'Славу': (2, -9), 'Осоко': (3, -10),
       'Позняк': (4, -11), 'Харкі': (5, -11), 'Вирлиц': (6, -10), 'Борис': (7, -9), 'Черво': (8, -8)}
# Дізнаємося кольори вершин
node_colors = nx.get_node_attributes(G, 'color').values()

DG = nx.DiGraph(G)

# Рисуємо граф
nx.draw(DG, pos, with_labels=True, font_weight='bold', node_size=800, node_color=node_colors, edge_color='gray')

if __name__ == '__main__':
    plt.show()

    num_nodes = DG.number_of_nodes()
    num_edges = DG.number_of_edges()
    degree_centrality = nx.degree_centrality(DG)
    deg_centr_filter = [(key, round(value, 2)) for key, value in degree_centrality.items() if value > 0.11]

    print(f'Кількість вузлів: {num_nodes}, n\кількість ребер: {num_edges}')

    print(f'Ступінь центральності:\n{deg_centr_filter}')