from random import uniform
import pprint

from dijkstra import dijkstra


graph = {
'Акад': ['Житом'],
'Житом': ['Акад', 'Свят'],
'Свят': ['Житом', 'Нивки'],
'Нивки': ['Свят', 'Берес'],
'Берес': ['Нивки', 'Шуляв'],
'Шуляв': ['Берес', 'Політ'],
'Політ': ['Шуляв', 'Вокза'],
'Вокза': ['Політ', 'Уніве'],
'Уніве': ['Вокза', 'Театр'],
'Театр': ['Уніве', 'Хрещ', 'Золот'],
'Хрещ': ['Театр', 'Арсен', 'Майдан'],
'Арсен': ['Хрещ', 'Дніпр'],
'Дніпр': ['Арсен', 'Гідро'],
'Гідро': ['Дніпр', 'Лівоб'],
'Лівоб': ['Гідро', 'Дарниц'],
'Дарниц': ['Лівоб', 'Черніг'],
'Черніг': ['Дарниц', 'Лісова'],
'Лісова': ['Черніг'],
'Герої': ['Мінсь'],
'Мінсь': ['Герої', 'Оболо'],
'Оболо': ['Мінсь', 'Петрі'],
'Петрі': ['Оболо', 'Тарас'],
'Тарас': ['Петрі', 'Контр'],
'Контр': ['Тарас', 'Пошто'],
'Пошто': ['Контр', 'Майдан'],
'Майдан': ['Пошто', 'Площа Л', 'Хрещ'],
'Площа Л': ['Майдан', 'Олімп', 'Палац С'],
'Олімп': ['Площа Л', 'Палац У'],
'Палац У': ['Олімп', 'Либід'],
'Либід': ['Палац У', 'Демії'],
'Демії': ['Либід', 'Голос'],
'Голос': ['Демії', 'Васил'],
'Васил': ['Голос', 'Виста'],
'Виста': ['Васил', 'Іподр'],
'Іподр': ['Виста', 'Терем'],
'Терем': ['Іподр'],
'Сирец': ['Дорог'],
'Дорог': ['Сирец', "Лук'я"],
"Лук'я": ['Дорог', 'Золот'],
'Золот': ["Лук'я", 'Палац С', 'Театр'],
'Палац С': ['Золот', 'Кловсь', 'Площа Л'],
'Кловсь': ['Палац С', 'Печер'],
'Печер': ['Кловсь', 'Звіри'],
'Звіри': ['Печер', 'Видуб'],
'Видуб': ['Звіри', 'Славу'],
'Славу': ['Видуб', 'Осоко'],
'Осоко': ['Славу', 'Позняк'],
'Позняк': ['Осоко', 'Харкі'],
'Харкі': ['Позняк', 'Вирлиц'],
'Вирлиц': ['Харкі', 'Борис'],
'Борис': ['Вирлиц', 'Черво'],
'Черво': ['Борис']
}


# Вводитии час між станціями в ручну занадто довго, 
# тому пропишемо код що буде випадкович чином визначати час між станціями в хвилинах
def random_time_station(graph_stations):
    graph_ws_rand_time = dict()
    for k, v in graph_stations.items():
        d = dict()
        for statin in v:
            d.update({statin : round(uniform(0.5, 4), 1)})
        graph_ws_rand_time.update({k : d})
    return graph_ws_rand_time

# pprint.pprint(random_time_station(graph))

pprint.pprint(dijkstra(random_time_station(graph), 'Акад'))
